reports/stage_1/log/get/wrk_get_r_15000_log
alexander@alexander-desktop:~/Projects/2021-highload-dht/wrk$ wrk -c 1 -t 1 -d 30s -R 15000 -L -s get.lua http://localhost:8080
Running 30s test @ http://localhost:8080
  1 threads and 1 connections
  Thread calibration: mean lat.: 0.642ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   636.91us  463.83us   9.10ms   82.83%
    Req/Sec    15.80k     1.21k   24.20k    74.02%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  605.00us
 75.000%    0.88ms
 90.000%    1.05ms
 99.000%    1.92ms
 99.900%    5.88ms
 99.990%    8.16ms
 99.999%    9.04ms
100.000%    9.11ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.024     0.000000            1         1.00
       0.151     0.100000        30033         1.11
       0.265     0.200000        60069         1.25
       0.379     0.300000        90208         1.43
       0.492     0.400000       120131         1.67
       0.605     0.500000       150169         2.00
       0.661     0.550000       165129         2.22
       0.717     0.600000       180095         2.50
       0.773     0.650000       195035         2.86
       0.828     0.700000       209951         3.33
       0.884     0.750000       225145         4.00
       0.911     0.775000       232532         4.44
       0.939     0.800000       240146         5.00
       0.966     0.825000       247475         5.71
       0.993     0.850000       254968         6.67
       1.020     0.875000       262463         8.00
       1.034     0.887500       266389         8.89
       1.047     0.900000       270075        10.00
       1.060     0.912500       273759        11.43
       1.073     0.925000       277511        13.33
       1.087     0.937500       281450        16.00
       1.094     0.943750       283109        17.78
       1.123     0.950000       284921        20.00
       1.227     0.956250       286786        22.86
       1.339     0.962500       288664        26.67
       1.459     0.968750       290537        32.00
       1.519     0.971875       291482        35.56
       1.581     0.975000       292417        40.00
       1.645     0.978125       293347        45.71
       1.713     0.981250       294290        53.33
       1.783     0.984375       295221        64.00
       1.819     0.985938       295689        71.11
       1.856     0.987500       296168        80.00
       1.896     0.989062       296627        91.43
       1.940     0.990625       297097       106.67
       1.993     0.992188       297567       128.00
       2.025     0.992969       297797       142.22
       2.077     0.993750       298034       160.00
       2.261     0.994531       298267       182.86
       2.511     0.995313       298500       213.33
       2.871     0.996094       298734       256.00
       3.075     0.996484       298852       284.44
       3.289     0.996875       298968       320.00
       3.497     0.997266       299085       365.71
       3.767     0.997656       299203       426.67
       4.163     0.998047       299320       512.00
       4.431     0.998242       299378       568.89
       4.675     0.998437       299438       640.00
       5.083     0.998633       299496       731.43
       5.515     0.998828       299554       853.33
       5.923     0.999023       299613      1024.00
       6.099     0.999121       299642      1137.78
       6.347     0.999219       299671      1280.00
       6.587     0.999316       299700      1462.86
       6.863     0.999414       299730      1706.67
       7.079     0.999512       299759      2048.00
       7.179     0.999561       299774      2275.56
       7.287     0.999609       299788      2560.00
       7.407     0.999658       299803      2925.71
       7.539     0.999707       299818      3413.33
       7.663     0.999756       299832      4096.00
       7.727     0.999780       299840      4551.11
       7.795     0.999805       299848      5120.00
       7.859     0.999829       299854      5851.43
       7.927     0.999854       299862      6826.67
       8.059     0.999878       299869      8192.00
       8.115     0.999890       299873      9102.22
       8.199     0.999902       299876     10240.00
       8.335     0.999915       299880     11702.86
       8.471     0.999927       299884     13653.33
       8.567     0.999939       299887     16384.00
       8.631     0.999945       299889     18204.44
       8.695     0.999951       299891     20480.00
       8.759     0.999957       299893     23405.71
       8.823     0.999963       299895     27306.67
       8.855     0.999969       299896     32768.00
       8.887     0.999973       299897     36408.89
       8.919     0.999976       299898     40960.00
       8.951     0.999979       299899     46811.43
       8.983     0.999982       299900     54613.33
       9.007     0.999985       299901     65536.00
       9.007     0.999986       299901     72817.78
       9.039     0.999988       299902     81920.00
       9.039     0.999989       299902     93622.86
       9.071     0.999991       299903    109226.67
       9.071     0.999992       299903    131072.00
       9.071     0.999993       299903    145635.56
       9.095     0.999994       299904    163840.00
       9.095     0.999995       299904    187245.71
       9.095     0.999995       299904    218453.33
       9.095     0.999996       299904    262144.00
       9.095     0.999997       299904    291271.11
       9.111     0.999997       299905    327680.00
       9.111     1.000000       299905          inf
#[Mean    =        0.637, StdDeviation   =        0.464]
#[Max     =        9.104, Total count    =       299905]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  449970 requests in 30.00s, 31.64MB read
Requests/sec:  14999.01
Transfer/sec:      1.05MB